CQADu/HT32F165x/例子代码/MP3/HT32_STD_1xxxx_FWLib_v002_1406/example/EXTI/WakeUp_DeepSleepMode1/main.c
/*********************************************************************************************************//**
 * @file    EXTI/WakeUp_DeepSleepMode1/main.c
 * @version $Rev:: 427          $
 * @date    $Date:: 2017-07-04 #$
 * @brief   Main program.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_board.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup EXTI_Examples EXTI
  * @{
  */

/** @addtogroup WakeUp_DeepSleepMode1
  * @{
  */


/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Main program.
  * @retval None
  ***********************************************************************************************************/
int main(void)
{
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{0}};

  /* Initialize LEDs                                                                                        */
  HT32F_DVB_LEDInit(HT_LED1);
  HT32F_DVB_LEDInit(HT_LED2);
  HT32F_DVB_LEDInit(HT_LED3);

  /* Turn on LEDs                                                                                           */
  HT32F_DVB_LEDOn(HT_LED1);
  HT32F_DVB_LEDOn(HT_LED2);
  HT32F_DVB_LEDOn(HT_LED3);

  /* Enable EXTI & GPIO APB clock                                                                           */
  CKCUClock.Bit.PC         = 1;
  CKCUClock.Bit.AFIO       = 1;
  CKCUClock.Bit.EXTI       = 1;
  CKCU_PeripClockConfig(CKCUClock, ENABLE);

  /* Configure Deep Sleep Mode 1                                                                            */
  NVIC_LowPowerConfig(NVIC_LOWPOWER_SLEEPDEEP, ENABLE);

  /* Configure Event Wake Up Interrupt Channel                                                              */
  NVIC_EnableIRQ(EVWUP_IRQn);

  /* Enable GPIO Input Function                                                                             */
  GPIO_InputConfig(HT_GPIOC, GPIO_PIN_15, ENABLE);

  /* Configure alternated mode 1 of GPIO                                                                    */
  AFIO_GPxConfig(GPIO_PC, AFIO_PIN_15, AFIO_MODE_1);

  /* Select Port as EXTI Trigger Source                                                                     */
  AFIO_EXTISourceConfig(AFIO_EXTI_CH_15, AFIO_ESS_PC);

  /* EXTI Event Related Configuration                                                                       */
  EXTI_WakeupEventConfig(EXTI_CHANNEL_15, EXTI_WAKEUP_HIGH_LEVEL, ENABLE);
  EXTI_WakeupEventIntConfig(ENABLE);

  /* Enter deep sleep mode 1 & Wait For event occurrence                                                    */
  __WFI();

  /* Configure SysTick in order to toggle LEDs                                                              */
  SysTick_Config(0xFFFFFF);

  while (1);
}

#if (HT32_LIB_DEBUG == 1)
/*********************************************************************************************************//**
  * @brief  Report both the error name of the source file and the source line number.
  * @param  filename: pointer to the source file name.
  * @param  uline: error line source number.
  * @retval None
  ***********************************************************************************************************/
void assert_error(u8* filename, u32 uline)
{
  /*
     This function is called by IP library that the invalid parameters has been passed to the library API.
     Debug message can be added here.
     Example: printf("Parameter Error: file %s on line %d\r\n", filename, uline);
  */

  while (1)
  {
  }
}
#endif


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
